{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyPr63hihk1OKR98bn/Fr4J+"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"-T9JwZl5Hk2B","executionInfo":{"status":"ok","timestamp":1700965795636,"user_tz":300,"elapsed":113219,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}},"outputId":"7ada6cfb-2c88-448d-bd59-51420a91c5de"},"outputs":[{"output_type":"stream","name":"stdout","text":["Mounted at /content/drive\n"]}],"source":["from google.colab import drive\n","drive.mount('/content/drive')"]},{"cell_type":"code","source":["!pip install langchain neo4j"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"e18xWA_KHo20","executionInfo":{"status":"ok","timestamp":1700965829340,"user_tz":300,"elapsed":33708,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}},"outputId":"b4671e69-0c61-4297-ca82-8318a8d9b2f7"},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting langchain\n","  Downloading langchain-0.0.340-py3-none-any.whl (2.0 MB)\n","\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m2.0/2.0 MB\u001b[0m \u001b[31m9.8 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hCollecting neo4j\n","  Downloading neo4j-5.14.1.tar.gz (192 kB)\n","\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m192.8/192.8 kB\u001b[0m \u001b[31m16.3 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25h  Installing build dependencies ... \u001b[?25l\u001b[?25hdone\n","  Getting requirements to build wheel ... \u001b[?25l\u001b[?25hdone\n","  Installing backend dependencies ... \u001b[?25l\u001b[?25hdone\n","  Preparing metadata (pyproject.toml) ... \u001b[?25l\u001b[?25hdone\n","Requirement already satisfied: PyYAML>=5.3 in /usr/local/lib/python3.10/dist-packages (from langchain) (6.0.1)\n","Requirement already satisfied: SQLAlchemy<3,>=1.4 in /usr/local/lib/python3.10/dist-packages (from langchain) (2.0.23)\n","Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in /usr/local/lib/python3.10/dist-packages (from langchain) (3.8.6)\n","Requirement already satisfied: anyio<4.0 in /usr/local/lib/python3.10/dist-packages (from langchain) (3.7.1)\n","Requirement already satisfied: async-timeout<5.0.0,>=4.0.0 in /usr/local/lib/python3.10/dist-packages (from langchain) (4.0.3)\n","Collecting dataclasses-json<0.7,>=0.5.7 (from langchain)\n","  Downloading dataclasses_json-0.6.2-py3-none-any.whl (28 kB)\n","Collecting jsonpatch<2.0,>=1.33 (from langchain)\n","  Downloading jsonpatch-1.33-py2.py3-none-any.whl (12 kB)\n","Collecting langsmith<0.1.0,>=0.0.63 (from langchain)\n","  Downloading langsmith-0.0.66-py3-none-any.whl (46 kB)\n","\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m46.8/46.8 kB\u001b[0m \u001b[31m6.7 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hRequirement already satisfied: numpy<2,>=1 in /usr/local/lib/python3.10/dist-packages (from langchain) (1.23.5)\n","Requirement already satisfied: pydantic<3,>=1 in /usr/local/lib/python3.10/dist-packages (from langchain) (1.10.13)\n","Requirement already satisfied: requests<3,>=2 in /usr/local/lib/python3.10/dist-packages (from langchain) (2.31.0)\n","Requirement already satisfied: tenacity<9.0.0,>=8.1.0 in /usr/local/lib/python3.10/dist-packages (from langchain) (8.2.3)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j) (2023.3.post1)\n","Requirement already satisfied: attrs>=17.3.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (23.1.0)\n","Requirement already satisfied: charset-normalizer<4.0,>=2.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (3.3.2)\n","Requirement already satisfied: multidict<7.0,>=4.5 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (6.0.4)\n","Requirement already satisfied: yarl<2.0,>=1.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (1.9.2)\n","Requirement already satisfied: frozenlist>=1.1.1 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (1.4.0)\n","Requirement already satisfied: aiosignal>=1.1.2 in /usr/local/lib/python3.10/dist-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (1.3.1)\n","Requirement already satisfied: idna>=2.8 in /usr/local/lib/python3.10/dist-packages (from anyio<4.0->langchain) (3.4)\n","Requirement already satisfied: sniffio>=1.1 in /usr/local/lib/python3.10/dist-packages (from anyio<4.0->langchain) (1.3.0)\n","Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio<4.0->langchain) (1.1.3)\n","Collecting marshmallow<4.0.0,>=3.18.0 (from dataclasses-json<0.7,>=0.5.7->langchain)\n","  Downloading marshmallow-3.20.1-py3-none-any.whl (49 kB)\n","\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m49.4/49.4 kB\u001b[0m \u001b[31m7.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hCollecting typing-inspect<1,>=0.4.0 (from dataclasses-json<0.7,>=0.5.7->langchain)\n","  Downloading typing_inspect-0.9.0-py3-none-any.whl (8.8 kB)\n","Collecting jsonpointer>=1.9 (from jsonpatch<2.0,>=1.33->langchain)\n","  Downloading jsonpointer-2.4-py2.py3-none-any.whl (7.8 kB)\n","Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=1->langchain) (4.5.0)\n","Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests<3,>=2->langchain) (2.0.7)\n","Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.10/dist-packages (from requests<3,>=2->langchain) (2023.7.22)\n","Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from SQLAlchemy<3,>=1.4->langchain) (3.0.1)\n","Requirement already satisfied: packaging>=17.0 in /usr/local/lib/python3.10/dist-packages (from marshmallow<4.0.0,>=3.18.0->dataclasses-json<0.7,>=0.5.7->langchain) (23.2)\n","Collecting mypy-extensions>=0.3.0 (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7,>=0.5.7->langchain)\n","  Downloading mypy_extensions-1.0.0-py3-none-any.whl (4.7 kB)\n","Building wheels for collected packages: neo4j\n","  Building wheel for neo4j (pyproject.toml) ... \u001b[?25l\u001b[?25hdone\n","  Created wheel for neo4j: filename=neo4j-5.14.1-py3-none-any.whl size=267560 sha256=4ad897551cd54d366fe02d25eebbf2d1503b32c0944d73c550927fae70a3d9a1\n","  Stored in directory: /root/.cache/pip/wheels/13/01/ff/de2142e172dafcd475f118499db2140c66562e42fd500c460a\n","Successfully built neo4j\n","Installing collected packages: neo4j, mypy-extensions, marshmallow, jsonpointer, typing-inspect, langsmith, jsonpatch, dataclasses-json, langchain\n","Successfully installed dataclasses-json-0.6.2 jsonpatch-1.33 jsonpointer-2.4 langchain-0.0.340 langsmith-0.0.66 marshmallow-3.20.1 mypy-extensions-1.0.0 neo4j-5.14.1 typing-inspect-0.9.0\n"]}]},{"cell_type":"code","source":["from neo4j import GraphDatabase\n","from langchain.graphs import Neo4jGraph\n","\n","url = \"neo4j+s://ef25c60e.databases.neo4j.io:7687\"\n","username =\"neo4j\"\n","password = \"feETGcSzytANIOqCRF00tj__BWyCx9r-DpmDPTpY984\"\n","\n","# graph = Neo4jGraph(\n","#     url=url,\n","#     username=username,\n","#     password=password\n","# )\n","\n","# Connect to the neo4j database server\n","graphDB_Driver = GraphDatabase.driver(url, auth=(username, password))"],"metadata":{"id":"RZS2WQ0bHtmO","executionInfo":{"status":"ok","timestamp":1700965830313,"user_tz":300,"elapsed":979,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":3,"outputs":[]},{"cell_type":"code","source":["subj, subj_type = 'Walmart', 'Facility'\n","\n","cqlQuerySubj = f'MATCH ({subj}:{subj_type} {{ name: \"{subj}\" }}) RETURN {subj}'\n","\n","flag = 0\n","\n","with graphDB_Driver.session() as graphDB_Session:\n","    subject = graphDB_Session.run(cqlQuerySubj)\n","    for s in subject:\n","        flag = 1\n","        break\n","\n","flag"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"LBQ-ADtFhCgS","executionInfo":{"status":"ok","timestamp":1700965830959,"user_tz":300,"elapsed":649,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}},"outputId":"9dc86ff9-104c-4be6-9b42-9bd58532a79f"},"execution_count":4,"outputs":[{"output_type":"execute_result","data":{"text/plain":["0"]},"metadata":{},"execution_count":4}]},{"cell_type":"code","source":["if subject:\n","    print(1)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"gXXuyvCxhyk3","executionInfo":{"status":"ok","timestamp":1700965830959,"user_tz":300,"elapsed":9,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}},"outputId":"bec4ee8b-a03c-4961-9eab-78a10a963c0c"},"execution_count":5,"outputs":[{"output_type":"stream","name":"stdout","text":["1\n"]}]},{"cell_type":"code","source":["# # CQL to create a graph containing some of the Ivy League universities\n","# cqlCreate = \"\"\"CREATE (cornell:university { name: \"Cornell University\"}),\n","# (yale:university { name: \"Yale University\"}),\n","# (princeton:university { name: \"Princeton University\"}),\n","# (harvard:university { name: \"Harvard University\"}),\n","\n","# (cornell)-[:connects_in {miles: 259}]->(yale),\n","# (cornell)-[:connects_in {miles: 210}]->(princeton),\n","# (cornell)-[:connects_in {miles: 327}]->(harvard),\n","\n","# (yale)-[:connects_in {miles: 259}]->(cornell),\n","# (yale)-[:connects_in {miles: 133}]->(princeton),\n","# (yale)-[:connects_in {miles: 133}]->(harvard),\n","\n","# (harvard)-[:connects_in {miles: 327}]->(cornell),\n","# (harvard)-[:connects_in {miles: 133}]->(yale),\n","# (harvard)-[:connects_in {miles: 260}]->(princeton),\n","\n","# (princeton)-[:connects_in {miles: 210}]->(cornell),\n","# (princeton)-[:connects_in {miles: 133}]->(yale),\n","# (princeton)-[:connects_in {miles: 260}]->(harvard)\"\"\"\n","\n","# # CQL to query all the universities present in the graph\n","# cqlNodeQuery = \"MATCH (x:university) RETURN x\"\n","\n","# # CQL to query the distances from Yale to some of the other Ivy League universities\n","# cqlEdgeQuery = \"MATCH (x:university {name:'Yale University'})-[r]->(y:university) RETURN y.name,r.miles\"\n","\n","# # CQL to delete all nodes and relationships\n","# cqlDelete = 'MATCH (n) DETACH DELETE n'"],"metadata":{"id":"TeawzljKP1Yn","executionInfo":{"status":"ok","timestamp":1700965830959,"user_tz":300,"elapsed":6,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":6,"outputs":[]},{"cell_type":"code","source":["# with graphDB_Driver.session() as graphDB_Session:\n","\n","#     # Create nodes and relationships\n","#     graphDB_Session.run(cqlCreate)\n","\n","#     # Query the graph\n","#     nodes = graphDB_Session.run(cqlNodeQuery)\n","#     print(\"List of Ivy League universities present in the graph:\")\n","\n","#     for node in nodes:\n","#         print(node)\n","\n","#     # Query the relationships present in the graph\n","#     nodes = graphDB_Session.run(cqlEdgeQuery)\n","#     print(\"Distance from Yale University to the other Ivy League universities present in the graph:\")\n","\n","#     for node in nodes:\n","#         print(node)\n","\n","#     graphDB_Session.run(cqlDelete)"],"metadata":{"id":"fqhj4sWSQ6W_","executionInfo":{"status":"ok","timestamp":1700965830959,"user_tz":300,"elapsed":6,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":7,"outputs":[]},{"cell_type":"code","source":[],"metadata":{"id":"WMVJj7ZqSnVD","executionInfo":{"status":"ok","timestamp":1700965830960,"user_tz":300,"elapsed":6,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":7,"outputs":[]},{"cell_type":"code","source":[],"metadata":{"id":"tBNqS5roSnXZ","executionInfo":{"status":"ok","timestamp":1700965830960,"user_tz":300,"elapsed":6,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":7,"outputs":[]},{"cell_type":"code","source":["from langchain.text_splitter import RecursiveCharacterTextSplitter\n","\n","import json, os, requests, re\n","import pandas as pd\n","from tqdm import tqdm\n","\n","import warnings\n","warnings.filterwarnings(\"ignore\")"],"metadata":{"id":"sI48iFWWQ6ZV","executionInfo":{"status":"ok","timestamp":1700965830960,"user_tz":300,"elapsed":5,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":8,"outputs":[]},{"cell_type":"code","source":["file_path = '/content/drive/MyDrive/Capstone Project/All_Jasons'\n","\n","def read_jsons(file_path):\n","    '''\n","    all_contents: a dict contains {title:content},\n","    content: a dict contains {\"page_x_text\":text}\n","    '''\n","    all_contents = {}\n","    for file in os.listdir(file_path):\n","        if file.endswith(\".json\"):\n","            f = open(file_path+\"/\"+file)\n","            passage = json.load(f)\n","            article = passage['Article']\n","            text_label = 'plum_contents'\n","            if text_label not in passage:\n","                text_label = 'ocr_contents'\n","            contents = passage[text_label]\n","            f.close()\n","\n","            all_contents[article] = contents\n","\n","    return all_contents\n","\n","all_contents = read_jsons(file_path)"],"metadata":{"id":"lxEhVrQPR-VZ","executionInfo":{"status":"ok","timestamp":1700965836435,"user_tz":300,"elapsed":5479,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":9,"outputs":[]},{"cell_type":"code","source":["meta_data = []\n","for i in all_contents.keys():\n","    article = i\n","    article_text =  all_contents[article]\n","    article_text = list(article_text.values())\n","    for pages in range(len(article_text)):\n","        page_text = article_text[pages]\n","        sentences = page_text.split(\".\")\n","        for j in range(len(sentences)):\n","            sentence = sentences[j]\n","            if len(sentence)> 50:\n","                dic = {}\n","                dic[\"text\"] = sentences[j]\n","                meta_data.append(dic)"],"metadata":{"id":"D-kkLxakR_js","executionInfo":{"status":"ok","timestamp":1700965837111,"user_tz":300,"elapsed":679,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":10,"outputs":[]},{"cell_type":"code","source":["len(meta_data)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"9YTuZ29HR0vY","executionInfo":{"status":"ok","timestamp":1700965837112,"user_tz":300,"elapsed":5,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}},"outputId":"3d8ed006-c49f-4264-ea9a-bf43c5e478ed"},"execution_count":11,"outputs":[{"output_type":"execute_result","data":{"text/plain":["95691"]},"metadata":{},"execution_count":11}]},{"cell_type":"code","source":[],"metadata":{"id":"fZfJr4ziSocp"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":[],"metadata":{"id":"eWy9jD1WSofQ"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["API_URL = \"https://api-inference.huggingface.co/models/bigscience/bloom\"\n","headers = {\"Authorization\": \"Bearer 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\"}\n","\n","def query(payload):\n","    response = requests.post(API_URL, headers=headers, json=payload)\n","    return response.json()"],"metadata":{"id":"aqmrqa6kR0xt"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["category = '''Category 1: ActTowards\n","Produce, create, present, implement, construct, operate, perform, conduct, run, tend, carry, start, build\n","\n","Category 2: CommunicatesWith\n","describe, express, indicate, note, suggest, propose, discuss, explain, report, represent, illustrate, refer, mention, reveal, specify\n","\n","Category 3: InteractsWith\n","connect, relate, associate, link, integrate, combine, incorporate, meet, interact, engage, cooperate, communicate, collaborate\n","\n","Category 4: Supplies\n","give, share, offer, provide, supply, deliver\n","\n","Category 5: Demands\n","need, require, demand, depend\n","\n","Category 6: Acquires\n","order, obtain, purchase, buy, acquire, receive, trade, sell\n","\n","Category 7: Transforms\n","change, transform, adapt, shift\n","\n","Category 8: Decides\n","choose, decide, select, pick, opt\n","\n","Category 9: Assesses\n","measure, assess, evaluate, calculate, test, examine, investigate\n","\n","Category 10: Solves\n","solve, fix, resolve, address\n","\n","Category 11: Develops\n","increase, develop, improve, grow, progress, advance, evolve, proceed\n","\n","Category 12: Impacts\n","affect, influence, Impact, contribute, facilitate\n","\n","Category 13: Manages\n","manage, control, coordinate, regulate, arrange, organize, sort\n","\n","Category 14: Moves\n","move, go, travel, journey, walk\n","\n","Category 15: Happens\n","occur, happen, continue, remain'''"],"metadata":{"id":"gOORm57WR02s"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["allowed_nodes = [\"Person\", \"Company\", \"Organization\", \"Facility\", \"Location\", \"GeoPoliticalEntity\", \"Time\", \"Date\", \"Event\", \"Product\", \"Regulation\"]\n","node_str = ', '.join(allowed_nodes)\n","node_str"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":35},"id":"YWy5nMyHWMs-","executionInfo":{"status":"ok","timestamp":1700870166093,"user_tz":300,"elapsed":7,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}},"outputId":"eed6ca62-b603-4d2b-8c9e-b758e83c013f"},"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["'Person, Company, Organization, Facility, Location, GeoPoliticalEntity, Time, Date, Event, Product, Regulation'"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"}},"metadata":{},"execution_count":14}]},{"cell_type":"code","source":["pattern = r'\\(([^,]+), ([^,]+), ([^)]+)\\) \\+ \\(([^,]+), ([^,]+), ([^)]+)\\)'"],"metadata":{"id":"J72vKrfdQ6cB"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["# df = pd.DataFrame(columns = ['sentence_index', 'subject', 'predicate', 'object', 'subject_type', 'predicate_type', 'object_type'])\n","# df\n","\n","csv_path = '/content/drive/MyDrive/Capstone Project/triplets/triples_BLOOM.csv'\n","\n","df = pd.read_csv(csv_path)\n","df.head()\n","print(len(df))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ipcw6lBtQ6en","executionInfo":{"status":"ok","timestamp":1700966060038,"user_tz":300,"elapsed":649,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}},"outputId":"44c62216-d59f-49f6-f4fe-23ee6be8ffba"},"execution_count":15,"outputs":[{"output_type":"stream","name":"stdout","text":["6396\n"]}]},{"cell_type":"code","source":["max_idx = max(df.sentence_index)\n","max_idx"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"NpWivJJjmYoT","executionInfo":{"status":"ok","timestamp":1700958550750,"user_tz":300,"elapsed":146,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}},"outputId":"6cbd636a-26fc-4b72-d118-cbe17ac8dcd0"},"execution_count":14,"outputs":[{"output_type":"execute_result","data":{"text/plain":["95685"]},"metadata":{},"execution_count":14}]},{"cell_type":"code","source":["# file_name = \"output.txt\"\n","\n","start_idx, end_index = max_idx + 1, 96000\n","sentence_idx = start_idx\n","\n","\n","for text_dict in tqdm(meta_data[start_idx:end_index]):\n","\n","    tgt_sentence = text_dict['text'].lstrip().lstrip(',').lstrip()\n","\n","\n","    prompt = f'''In the context of Knowledge Graphs, Resource Description Framework (RDF) serves as a widely adopted format for expressing information using subject-predicate-object triplets. Each RDF triplet consists of three components:\n","\n","In the field of supply chain, there are 15 pre-defined categories of predicates, which are as follows.\n","\n","{category}\n","\n","There are also several types of subjects or objects, namely {node_str}.\n","\n","Consider the sentence \"Apple contributes to the economy of China.\" In this case, the subject, predicate, and object are respectively \"Apple,\" \"contribute to,\" and \"the economy of China.\" The predicate \"contribute to\" belongs to the category of \"Impacts.\" The subject \"Apple\" belongs to \"Company\", and the object \"the economy of China\" belongs to \"GeoPoliticalEntity.\" We format the triplet output as (subject, predicate, object) + (subject category, predicate category, object category), which is (Apple, contribute to, the economy of China) + (Company, Impacts, GeoPoliticalEntity) for this sentence.\n","\n","It's important to note that a single sentence can contain multiple triplets. For example, in the sentence, \"Walmart developed a service with IBM to monitor produce in China,\" the output should consist of two triplets, including (Walmart, develop with, IBM) + (Company, Develops, Company) and (Walmart, monitor, produce in China) + (Company, Assesses, GeoPoliticalEntity).\n","\n","Given the above information, for the sentence \"{tgt_sentence},\" the correct output should be '''\n","\n","\n","    output = query({\"inputs\": prompt})\n","    if type(output).__name__ == 'dict':\n","        print(sentence_idx)\n","        print(output)\n","        sentence_idx += 1\n","        continue\n","\n","    output_text = output[0]['generated_text']\n","    output_text = output_text.replace(prompt, '')\n","\n","    # with open(file_name, \"a\") as file:\n","    #     file.write(output_text + '\\n')\n","\n","    matches = re.findall(pattern, output_text)\n","    for m in matches:\n","        phrase1, phrase2, phrase3, phrase4, phrase5, phrase6 = m\n","        new_row = {'sentence_index': sentence_idx, 'subject': phrase1, 'predicate': phrase2, 'object': phrase3,\n","                   'subject_type': phrase4, 'predicate_type': phrase5, 'object_type': phrase6}\n","        df = df.append(new_row, ignore_index=True)\n","        df = df.drop_duplicates(subset=['subject', 'predicate', 'object', 'subject_type', 'predicate_type', 'object_type'], keep='first')\n","        df.to_csv(csv_path, index=False)\n","\n","    sentence_idx += 1"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"EhdjRKZOQ6hD","executionInfo":{"status":"ok","timestamp":1700897682451,"user_tz":300,"elapsed":17689183,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}},"outputId":"b1ac350e-c914-4685-d00b-a160c4f74c6f"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stderr","text":["  3%|▎         | 470/13522 [10:09<3:29:02,  1.04it/s]"]},{"output_type":"stream","name":"stdout","text":["82638\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1158', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":["  5%|▌         | 723/13522 [15:51<3:20:22,  1.06it/s]"]},{"output_type":"stream","name":"stdout","text":["82891\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1021', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":["  7%|▋         | 913/13522 [19:56<3:23:10,  1.03it/s]"]},{"output_type":"stream","name":"stdout","text":["83081\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1145', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":["  7%|▋         | 915/13522 [19:58<2:50:54,  1.23it/s]"]},{"output_type":"stream","name":"stdout","text":["83083\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1241', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":["  7%|▋         | 934/13522 [20:22<3:19:48,  1.05it/s]"]},{"output_type":"stream","name":"stdout","text":["83102\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1323', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":["  7%|▋         | 937/13522 [20:25<2:52:10,  1.22it/s]"]},{"output_type":"stream","name":"stdout","text":["83105\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1332', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":[" 11%|█▏        | 1549/13522 [33:53<2:50:03,  1.17it/s]"]},{"output_type":"stream","name":"stdout","text":["83717\n","{'error': 'Input validation error: `inputs` tokens + `max_new_tokens` must be <= 1512. Given: 1546 `inputs` tokens and 20 `max_new_tokens`', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":[" 20%|█▉        | 2694/13522 [59:19<3:40:25,  1.22s/it]"]},{"output_type":"stream","name":"stdout","text":["84862\n","{'error': 'Service Unavailable'}\n"]},{"output_type":"stream","name":"stderr","text":[" 24%|██▍       | 3306/13522 [1:12:37<2:46:53,  1.02it/s]"]},{"output_type":"stream","name":"stdout","text":["85474\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1011', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":[" 44%|████▍     | 5947/13522 [2:10:08<2:00:26,  1.05it/s]"]},{"output_type":"stream","name":"stdout","text":["88115\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1231', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":[" 88%|████████▊ | 11910/13522 [4:19:36<25:51,  1.04it/s]"]},{"output_type":"stream","name":"stdout","text":["94078\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1114', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":[" 90%|█████████ | 12175/13522 [4:25:24<21:59,  1.02it/s]"]},{"output_type":"stream","name":"stdout","text":["94343\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1090', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":[" 90%|█████████ | 12201/13522 [4:25:57<21:44,  1.01it/s]"]},{"output_type":"stream","name":"stdout","text":["94369\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1093', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":[" 90%|█████████ | 12224/13522 [4:26:26<21:39,  1.00s/it]"]},{"output_type":"stream","name":"stdout","text":["94392\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1088', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":[" 91%|█████████ | 12334/13522 [4:28:49<18:46,  1.05it/s]"]},{"output_type":"stream","name":"stdout","text":["94502\n","{'error': 'Input validation error: `inputs` must have less than 1000 tokens. Given: 1005', 'error_type': 'validation'}\n"]},{"output_type":"stream","name":"stderr","text":["100%|██████████| 13522/13522 [4:54:48<00:00,  1.31s/it]\n"]}]},{"cell_type":"code","source":["df.head(10)"],"metadata":{"id":"f_nV-q01P1jS"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["len(df)"],"metadata":{"id":"bKgBt8XOmYJG"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["df.to_csv(csv_path, index=False)"],"metadata":{"id":"V-yjha11S9kn"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":[],"metadata":{"id":"PQ2MfV8X69TG"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":[],"metadata":{"id":"VT4rycMdBoB7","executionInfo":{"status":"ok","timestamp":1700958480711,"user_tz":300,"elapsed":149,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":12,"outputs":[]},{"cell_type":"code","source":[],"metadata":{"id":"-xMWITRzBoEd","executionInfo":{"status":"ok","timestamp":1700966050341,"user_tz":300,"elapsed":136,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":11,"outputs":[]},{"cell_type":"code","source":[],"metadata":{"id":"gSvbraxU69Va","executionInfo":{"status":"ok","timestamp":1700966064230,"user_tz":300,"elapsed":144,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":15,"outputs":[]},{"cell_type":"code","source":["def is_node_in(node, node_type):\n","\n","    flag = 0\n","\n","    cqlNodeQuery = f'MATCH ({node}:{node_type} {{ name: \"{node}\" }}) RETURN {node}'\n","\n","    with graphDB_Driver.session() as graphDB_Session:\n","        try:\n","            nodes = graphDB_Session.run(cqlNodeQuery)\n","            for n in nodes:\n","                flag = 1\n","                break\n","        except:\n","            pass\n","\n","    return flag"],"metadata":{"id":"8GIEr2SxjPEr","executionInfo":{"status":"ok","timestamp":1700966064353,"user_tz":300,"elapsed":2,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":16,"outputs":[]},{"cell_type":"code","source":["def is_rel_in(subj, subj_type, predic, predic_type, obj, obj_type):\n","\n","    flag = 0\n","\n","    cqlRelQuery = f'MATCH ({subj}:{subj_type})-[:{predic_type} {{ name: \"{predic}\" }}]->({obj}:{obj_type}) RETURN {subj}, {obj}'\n","\n","    with graphDB_Driver.session() as graphDB_Session:\n","        try:\n","            rels = graphDB_Session.run(cqlRelQuery)\n","            for r in rels:\n","                flag = 1\n","                break\n","        except:\n","            pass\n","\n","    return flag"],"metadata":{"id":"GfHPkd2Xj7vm","executionInfo":{"status":"ok","timestamp":1700966064354,"user_tz":300,"elapsed":3,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":17,"outputs":[]},{"cell_type":"code","source":["# Neo4j: Create nodes and relationships\n","\n","for idx, row in tqdm(df.iterrows()):\n","\n","    try:\n","        subj, predic, obj = row['subject'].replace(' ', '_'), row['predicate'].replace(' ', '_'), row['object'].replace(' ', '_')\n","        subj_type, predic_type, obj_type = row['subject_type'].replace(' ', '_'), row['predicate_type'].replace(' ', '_'), row['object_type'].replace(' ', '_')\n","    except:\n","        print('Continue')\n","        continue\n","\n","    cqlCreateNodeSubj = f'CREATE ({subj}:{subj_type} {{ name: \"{subj}\" }})'\n","    cqlCreateNodeObj = f'CREATE ({obj}:{obj_type} {{ name: \"{obj}\" }})'\n","    cqlCreateRel = f'MATCH ({subj}:{subj_type} {{ name: \"{subj}\" }}), ({obj}:{obj_type} {{ name: \"{obj}\" }})\\nCREATE ({subj})-[:{predic_type} {{ name: \"{predic}\" }}]->({obj})'\n","\n","    with graphDB_Driver.session() as graphDB_Session:\n","\n","        if not is_node_in(subj, subj_type):\n","            try:\n","                graphDB_Session.run(cqlCreateNodeSubj)\n","            except:\n","                # print(cqlCreateNodeSubj)\n","                pass\n","\n","        if not is_node_in(obj, obj_type):\n","            try:\n","                graphDB_Session.run(cqlCreateNodeObj)\n","            except:\n","                # print(cqlCreateNodeObj)\n","                pass\n","\n","        if not is_rel_in(subj, subj_type, predic, predic_type, obj, obj_type):\n","            try:\n","                graphDB_Session.run(cqlCreateRel)\n","            except:\n","                # print(cqlCreateRel)\n","                pass"],"metadata":{"id":"1rRqPeZb69aU","colab":{"base_uri":"https://localhost:8080/"},"outputId":"36e80644-bfac-419c-f20c-dfba9dc4f994","executionInfo":{"status":"ok","timestamp":1700968060013,"user_tz":300,"elapsed":1995661,"user":{"displayName":"Yunjie Qian","userId":"16160804486899806073"}}},"execution_count":18,"outputs":[{"output_type":"stream","name":"stderr","text":["1330it [05:37,  3.52it/s]"]},{"output_type":"stream","name":"stdout","text":["Continue\n"]},{"output_type":"stream","name":"stderr","text":["6396it [33:15,  3.21it/s]\n"]}]}]}